/*
  FilterPresets.strings
  iina

  Created by lhc on 25/8/2017.
  Copyright © 2017 lhc. All rights reserved.
*/
/* It's optional to localize descriptions for each parameter! */



"crop" = "Кадрирование";
"crop.w" = "Ширина (по умолчанию: ширина видео)";
"crop.h" = "Высота (по умолчанию: высота видео)";
"crop.x" = "Позиция по горизонтали (по умолчанию: центр)";
"crop.y" = "Позиция по вертикали (по умолчанию: центр)";

"expand" = "Расширение";
"expand.w" = "Ширина (по умолчанию: ширина видео)";
"expand.h" = "Высота (по умолчанию: высота видео)";
"expand.x" = "Позиция по горизонтали (по умолчанию: центр)";
"expand.y" = "Позиция по вертикали (по умолчанию: центр)";
"expand.aspect" = "Сохранять пропорции (например, 4/3)";
"expand.round" = "Округлять, чтобы делилось на это значение";

"sharpen" = "Повышение резкости";
"sharpen.msize" = "Размер матрицы";
"sharpen.amount" = "Интенсивность";

"blur" = "Размытие";
"blur.msize" = "Размер матрицы";
"blur.amount" = "Эффект";

"delogo" = "Удаление логотипа";
"delogo.w" = "Ширина";
"delogo.h" = "Высота";
"delogo.x" = "Позиция по горизонтали";
"delogo.y" = "Позиция по вертикали";

"negative" = "Инвертировать";

"vflip" = "Перевернуть вертикально";
"hflip" = "Перевернуть горизонтально";

"lut3d" = "3D LUT";
"lut3d.file" = "Путь к файлу (вы также можете перетащить файл в поле ввода)";
"lut3d.interp" = "Режим интерполяции";

"custom_mpv" = "Свой (mpv)";
"custom_mpv.name" = "Фильтр";
"custom_mpv.string" = "Значение";

"custom_ffmpeg" = "Свой (FFmpeg)";
"custom_ffmpeg.name" = "Фильтр";
"custom_ffmpeg.string" = "Значение";
